In [1]:
import pandas as pd

# Series

In [3]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index_s = ['a', 'b', 'c', 'd', 'e']
ser = pd.Series([1,2,3,4,5], index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
ser[0], ser['c']

C:\Users\Admin\AppData\Local\Temp\ipykernel_10808\3588708418.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser['c']

(np.int64(1), np.int64(3))

In [9]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)
s3

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
ser2 = pd.Series([10, 'banana'])
ser2, type(ser2)

(0        10
 1    banana
 dtype: object,
 pandas.core.series.Series)

In [18]:
population = pd.Series([9776, 2729, 1566, 3158], index=['서울', '부산', '인천', '대구'])
print(population['서울'])
print(population[['서울', '부산']])   #0번, 1번 인덱스. 팬시인덱싱

9776
서울    9776
부산    2729
dtype: int64

In [20]:
population.info()   #정보들을 확인할 수 있는 함수.

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [24]:
ser.iloc[0], ser.loc['a']   #호출자. 0번지 호출해(숫자 인덱스 가지고 꺼내), 'a'번지 호출해(인덱스 이름 가지고 꺼내)

(np.int64(1), np.int64(1))

# DataFrame

In [4]:
import pandas as pd
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [5]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [6]:
scientists.iloc[0]   #-1은 쓸 수 없다

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [7]:
scientists['Name']   #시리즈

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [8]:
scientists.index = ['Rosaline Franklin', 'William Gosset']
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

iloc[]는 indexlocator -> 숫자 인덱스 꺼낼 때<br>
loc[]는 locator -> 문자 인덱스 꺼낼 때

In [9]:
scientists.loc['William Gosset']   #인덱스를 바꿔주면 해댱 인덱스로 꺼낼 수 있다.

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [10]:
#[행,열] 인덱싱
scientists.loc['William Gosset', 'Born']

'1876-06-13'

In [12]:
#[시작행:끝행:, 시작열:끝열] 쉼표는 행과열 차원을 구분
scientists.iloc[:, :2]

                                Name    Occupation
Rosaline Franklin  Rosaline Franklin       Chemist
William Gosset        William Gosset  Statistician

In [36]:
scientists.iloc[1]

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [47]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [48]:
scientists.index

Index(['Rosaline Franklin', 'William Gosset'], dtype='object')

In [37]:
data = [[1,2,3], [4,5,6], [7,8,9]]
df = pd.DataFrame(data)
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [41]:
df = pd.DataFrame(data, columns=['A', 'B', 'C'], index=['one', 'two', 'three'])
print(df)

       A  B  C
one    1  2  3
two    4  5  6
three  7  8  9

In [45]:
print(df.loc['three']), print(df.iloc[1])

A    7
B    8
C    9
Name: three, dtype: int64
A    4
B    5
C    6
Name: two, dtype: int64

(None, None)

In [13]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

## 데이터프레임 미리보기

In [53]:
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [54]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [14]:
sci1.loc[0, 'Name']   #[row, column] 인덱싱

'Rosaline Franklin'

In [ ]:
sci1.iloc[1, 4]   #iloc로 William Gosset의 age추출

np.int64(61)

In [18]:
sci1.iloc[:,2:4]   #born, died만 추출

         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16

In [19]:
sci1.iloc[:, 1]   #occupation 추출

0         Chemist
1    Statistician
Name: Occupation, dtype: object

In [56]:
sci1.loc[0, 'Occupation']

'Chemist'

In [58]:
sci1.to_csv('./data/scientist_1.csv')

In [ ]:
sci1.to_csv('./data/scientist_2.csv', index=False)   #인덱스는 빼고 저장

In [ ]:
# pickle : 파이썬의 객체형을 저장하는 파일. 캡슐화된 데이터
sci1.to_pickle('./data/scientist.pickle')

In [65]:
df2 = pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [61]:
df = pd.read_csv('./data/scientist_2.csv')   #읽을 때 인덱스 붙여서 나오게 됨. 그래서 보통 저장할 땐 인덱스는 빼고 저장함
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [66]:
df3 = pd.read_csv('./data/scientists.csv')
df3

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [67]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

# 데이터 미리보기

1.

In [74]:
df3.head()   #default = 5개 처음 행 미리보기

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [75]:
df3.tail(3)   #default = 5개 마지막 행 미리보기

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [78]:
df3.describe()   #기술 통계를 낼 수 있는(숫자형) column들만

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [88]:
df3['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [86]:
df3.loc[:,'Age']   #행 지정 안해주면 Error

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

# 행과 열 추가

In [83]:
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [67]:
print('=== head() ===')
print(df.head())   #처음 5개 행 보기

=== head() ===
    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88

In [68]:
print('=== tail(3) ===')
print(df.tail(3))   #마지막 3개 행 보기

=== tail(3) ===
    이름  나이  점수
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [69]:
print('=== info() ===')
print(df.info())   #데이터프레임 기본 정보

=== info() ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes
None

In [70]:
print('=== describe() ===')
print(df.describe())   #기술 통계량

=== describe() ===
              나이         점수
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

In [71]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [72]:
df.columns

Index(['이름', '나이', '점수'], dtype='object')

In [73]:
df.shape

(7, 3)

In [74]:
df.values

array([['김철수', 25, 85],
       ['이영희', 28, 92],
       ['박민수', 22, 78],
       ['정수진', 31, 95],
       ['최영호', 27, 88],
       ['한미래', 24, 73],
       ['윤지원', 29, 91]], dtype=object)

In [75]:
df.columns = ['name', 'age', 'score']   #column목록을 직접 변경 가능, 길이는 같아야함
df

  name  age  score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91

In [79]:
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']   #행 목록 변경
df

    이름  나이  점수
A  김철수  25  85
B  이영희  28  92
C  박민수  22  78
D  정수진  31  95
E  최영호  27  88
F  한미래  24  73
G  윤지원  29  91

In [80]:
#일부 열의 이름 변경
df.rename(columns={'name':'NAME', 'age':'AGE'})

    이름  나이  점수
A  김철수  25  85
B  이영희  28  92
C  박민수  22  78
D  정수진  31  95
E  최영호  27  88
F  한미래  24  73
G  윤지원  29  91

In [28]:
df.rename(index={'A':'a', 'C':'c'}, inplace=True)   #inplace=Ture로 두면 원본데이터가 바뀐다
df

    이름  나이  점수
a  김철수  25  85
B  이영희  28  92
c  박민수  22  78
D  정수진  31  95
E  최영호  27  88
F  한미래  24  73
G  윤지원  29  91

위에서 원본 데이터를 바꿔버리는 것보단 df1으로 변수에 할당받는 것을 추천한다.

In [81]:
df.iloc[0:2]   #행단위 슬라이싱

    이름  나이  점수
A  김철수  25  85
B  이영희  28  92

In [84]:
df.loc[0]   #행단위는 iloc, 이름단위는 loc로 구분

이름    김철수
나이     25
점수     85
Name: 0, dtype: object

In [33]:
df[df['나이'] > 25]   #조건을 사용해서 행 추출

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
4  최영호  27  88
6  윤지원  29  91

In [ ]:
df[df['점수'] > 90]

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
6  윤지원  29  91

In [85]:
df.loc[7] = ['홍길동', 30, 70]   #df.loc[]로 새로운 행 추가할 수 있다
#df.iloc[8] = ['김길동', 20, 99]   #df.iloc[]로는 추가할 수 없다.
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91
7  홍길동  30  70

In [41]:
#df.append([8, '박나래', 20, 50])   #append로 추가 불가능

In [86]:
df['grade'] = ['B', 'A', 'C', 'A', 'B', 'C', 'A', 'C']   #열 추가
df.rename(columns={'grade':'등급'}, inplace=True)   #등급으로 열 이름 변경
df

    이름  나이  점수 등급
0  김철수  25  85  B
1  이영희  28  92  A
2  박민수  22  78  C
3  정수진  31  95  A
4  최영호  27  88  B
5  한미래  24  73  C
6  윤지원  29  91  A
7  홍길동  30  70  C

In [87]:
df.insert(loc=1, column='student_id', value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008'])
df   #특정 위치에 열 추가

    이름 student_id  나이  점수 등급
0  김철수       S001  25  85  B
1  이영희       S002  28  92  A
2  박민수       S003  22  78  C
3  정수진       S004  31  95  A
4  최영호       S005  27  88  B
5  한미래       S006  24  73  C
6  윤지원       S007  29  91  A
7  홍길동       S008  30  70  C

In [89]:
df1 = df.drop(0, axis=0)   #inplace=True로 원본 데이터를 직접 드롭할 수 있다.
df1

    이름 student_id  나이  점수 등급
1  이영희       S002  28  92  A
2  박민수       S003  22  78  C
3  정수진       S004  31  95  A
4  최영호       S005  27  88  B
5  한미래       S006  24  73  C
6  윤지원       S007  29  91  A
7  홍길동       S008  30  70  C

In [55]:
df.drop('등급', axis=1)

    이름 student_id  나이  점수
0  김철수       S001  25  85
1  이영희       S002  28  92
2  박민수       S003  22  78
3  정수진       S004  31  95
4  최영호       S005  27  88
5  한미래       S006  24  73
6  윤지원       S007  29  91
7  홍길동       S008  30  70

In [57]:
df.iloc[:, 4:6]

  등급 등급
0  B  B
1  A  A
2  C  C
3  A  A
4  B  B
5  C  C
6  A  A
7  C  C

In [90]:
#df.drop(columns=df.columns[4], axis=1)   드롭가능해야하는데...
col_keep = [i for i in range(len(df.columns)) if i != 4]
df = df.iloc[:, col_keep]
df

    이름 student_id  나이  점수
0  김철수       S001  25  85
1  이영희       S002  28  92
2  박민수       S003  22  78
3  정수진       S004  31  95
4  최영호       S005  27  88
5  한미래       S006  24  73
6  윤지원       S007  29  91
7  홍길동       S008  30  70

In [65]:
df = df.astype({'나이':int, '점수':float})   #객체를 숫자형으로 변환
df['student_id'] = df['student_id'].astype(str)   #문자열로 변환
#df['data'] = pd.to_datetime(df['date'])   #날짜형으로 변환도 가능
df

    이름 student_id  나이    점수 등급
0  김철수       S001  25  85.0  B
1  이영희       S002  28  92.0  A
2  박민수       S003  22  78.0  C
3  정수진       S004  31  95.0  A
4  최영호       S005  27  88.0  B
5  한미래       S006  24  73.0  C
6  윤지원       S007  29  91.0  A
7  홍길동       S008  30  70.0  C

In [91]:
df.index

Index([0, 1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [95]:
df_new = df.set_index('student_id')
print(df_new.index)
df_new

Index(['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008'], dtype='object', name='student_id')

             이름  나이  점수
student_id
S001        김철수  25  85
S002        이영희  28  92
S003        박민수  22  78
S004        정수진  31  95
S005        최영호  27  88
S006        한미래  24  73
S007        윤지원  29  91
S008        홍길동  30  70

In [96]:
df_new.reset_index(inplace=True)
df_new

  student_id   이름  나이  점수
0       S001  김철수  25  85
1       S002  이영희  28  92
2       S003  박민수  22  78
3       S004  정수진  31  95
4       S005  최영호  27  88
5       S006  한미래  24  73
6       S007  윤지원  29  91
7       S008  홍길동  30  70

In [ ]:
dr = pd.date_range('2025-06-01', periods=8)   #periods안넣으면 default D
df_new['date'] = dr
df_new

  student_id   이름  나이  점수       date
0       S001  김철수  25  85 2025-06-01
1       S002  이영희  28  92 2025-06-02
2       S003  박민수  22  78 2025-06-03
3       S004  정수진  31  95 2025-06-04
4       S005  최영호  27  88 2025-06-05
5       S006  한미래  24  73 2025-06-06
6       S007  윤지원  29  91 2025-06-07
7       S008  홍길동  30  70 2025-06-08

In [102]:
df_new1 = df_new.set_index('date')
df_new1

           student_id   이름  나이  점수
date
2025-06-01       S001  김철수  25  85
2025-06-02       S002  이영희  28  92
2025-06-03       S003  박민수  22  78
2025-06-04       S004  정수진  31  95
2025-06-05       S005  최영호  27  88
2025-06-06       S006  한미래  24  73
2025-06-07       S007  윤지원  29  91
2025-06-08       S008  홍길동  30  70